import React from 'react';
import { View,StyleSheet, ImageBackground, ScrollView, Text } from 'react-native';
import { Colors } from 'react-native-paper';
import Header from '../components/Header';
import SearchBar from '../components/SearchBar';

function CharityScreen(props) {
 return (
   <View style={styles.container}>
     <Header />
     <SearchBar />
     <Text style={styles.Header}>نبذة عن الجمعية</Text>
     <ImageBackground
       source={require('../../assets/Mousq.png')}
       style={styles.image}
     />
     <ScrollView>
       <Text style={styles.regularText}>
         تأسست جمعية المواساة الإسلامية بالإسكندرية عام 1910 م .
       </Text>
       <Text style={styles.regularText}>
         1991 ميلادية، حتي وفاته يوم الأربعاء السادس عشر من شهر شعبان سنة 1431
         هجرية. الموافق الثامن و العشرون من شهر يوليو سنة 2010 ميلادية.
       </Text>
       <Text style={styles.regularText}>
         * شغل الأستاذ "محمد سيد أحمد" منصب رئيس مجلس الإدارة بعد وفاة الشيخ
         بأربعة أشهر، وهو ضابط بحري متقاعد، وقد تدرج سيادته خلال عمله في الجمعية
         من عضو في مجلس الإدارة ثم نائب لرئيس مجلس الأدارة وانتهاءً برئيس مجلس
         الإدارة حيث أجمع الأعضاء على ترأسه للمجلس الحالي.
       </Text>
       <Text style={styles.regularText}>
         * ومن أبرز الأنشطة والأعمال التي كُلف بها سيادته :-
       </Text>
       <Text style={styles.regularText}>
         1) دراسة تطوير (مستوصف جمعية المواساة) بالقبارى والأشراف على عمليات
         التطوير باللجنة المشكلة لذلك، ليصبح مركز المواساة الطبى مركزاً متميزاً
         لأهالى الأسكندرية بأسعار رمزية.
       </Text>
       <Text style={styles.regularText}>
         2) دراسة خاصة بإنشاء اللجان المختلفة للأنشطة، مثل: (لجنة أدارة المسجد /
         اللجنة المالية / لجنة نشر الثقافة / لجنة الزكاة / تعليم / كفالة مريض /
         الخ . . . .)
       </Text>
       <Text style={styles.regularText}>
         3) دراسة خاصة بإنشاء وتنظيم أرشيف الجمعية وأسلوب حفظ الوثائق وتداولها
       </Text>
       <Text style={styles.regularText}>
         4) دراسة تطوير (حضانة محرم بك) والأشراف على تنفيذها.
       </Text>
       <Text style={styles.regularText}>
         5) رئيس لجنة الإشراف على إنشاء منتجع المواساة (دار مسنين – قاعات –
         ندوات – مؤتمرات – عقد قران)
       </Text>
       <Text style={styles.regularText}>6) رئيس لجنة التفتيش والمتابعة.</Text>
       <Text style={styles.regularText}>7) عضو لجنة المشروعات بالجمعية.</Text>
       <Text style={styles.regularText}>
         * ومن الجدير بالذكر أن سيادته قد صاحب ورافق فضيلة الشيخ / ياسين رشدى ما
         يربو على أربعين عاماً في جميع مجالس العلم بالأسكندرية ومسجد الدكتور/
         مصطفى محمود بالقاهرة و كذا جميع اللقاءات بالشخصيات العامة بالقاهرة
         والأسكندرية وخارجها وظل على ذلك حتى انتقال الشيخ الى جوار ربه.
       </Text>
       <Text style={styles.regularText}>أغراض الجمعية</Text>
       <Text style={styles.regularText}>
         •جمع أموال الزكاة وتوزيعها على الأسر المستحقة من الفقراء
       </Text>
       <Text style={styles.regularText}>
         • المساهمة بالأموال اللازمة فى حالات الكوارث التى تصيب العائلات .
       </Text>
       <Text style={styles.regularText}>
         • المساهمة فى المعونات للمرضى بأمراض مستعصية مثل: ( السرطان وأمراض
         الكلية وأمراض القلب )
       </Text>
       <Text style={styles.regularText}>
         • معونات الطوارئ مثل العمليات الجراحية والأطراف الصناعية والمساهمة فى
         التعويض عن الأضرار الناتجة عن الحريق والمساهمة فى تأسيس منازل لبعض
         المؤلفة قلوبهم حديثاً .
       </Text>
       <Text style={styles.regularText}>
         • نشر الثقافة الإسلامية عن طريق مراسلة المراكز الإسلامية فى مختلف بلاد
         العالم ومدها بالكتب والنشرات والمصاحف التى تساعدهم فى نشر الدعوة
         الإسلامية فى بلادهم والرد على أسئلتهم واستفساراتهم الدينية وكـذا
         الفتاوى التى يطلونها .
       </Text>
       <Text style={styles.regularText}>
         • أوجه نشاط أخرى اجتماعية وخيرية مثل إنشاء دور للحضانة ومراكز رياضية
         للشباب ومركز طبى للعلاج وكفالة للتعليم وكفالة اليتيم.
       </Text>
       <Text style={styles.regularText}>
         أعمــال لجنــة نشـــر الثقـــافــة:
       </Text>
       <Text style={styles.regularText}>
         • البحث عن عناوين المراكز الإسلامية والهيئات الإسلامية فى دول العالم
         المختلفة • مكاتبة هذه المراكز وعرض خدماتها وهى: تلقى الأسئلة المختلفة و
         الرد عليها .
       </Text>
       <Text style={styles.regularText}>
         • تزويد المراكز الإسلامية بالكتب الإسلامية باللغات المختلفة: (إنجليزى -
         فرنسى - المانى - عربى)
       </Text>
       <Text style={styles.regularText}>
         • تزويد المراكز الإسلامية بالمصحف الكريم باللغة العربية وترجمة معانى
         القرآن باللغات الإنجليزية والفرنسية والألمانية.
       </Text>
       <Text style={styles.regularText}>
         • تزويد المراكز الإسلامية بتفسير آيات القرآن على شرائط كاسيت بصوت فضيلة
         الشيخ ياسين محمد رشدى – رحمه الله .
       </Text>
       <Text style={styles.regularText}>مصروفات اللجنة :</Text>
       <Text style={styles.regularText}>
         • مصروفات اللجنة هى رسوم الجمارك على الكتب والأشرطة وثمن طوابع البريد
         ورسوم التسجيل وتجهيز الطرود وحوالات بريدية لوزارة الثقافة .. أدوات
         كتابية متنوعة .
       </Text>
       <Text style={styles.regularText}>
         • يعتمد الصرف أساساً على حساب نشر الثقافة بالجمعية والذى مصدره الأساسى
         ما يدفعه السادة رواد المسجد تبرعاً منهم .
       </Text>
       <Text style={styles.regularText}> مشروعات اللجنة :</Text>
       <Text style={styles.regularText}>
         تقوم اللجنة بمراسلة أكثر من 1500 مركز إسلامى موزعة على بعض دول العالم
         مثل الولايات المتحدة الأمريكية والمانيا وجمهورية غانا وجمهورية توجو
         وجمهورية ساحل العاج والمملكة العربية السعودية والفلبين وجمهورية نيجيريا
         واستراليا والعدد الأكبر من هذه المراكز والمدارس والمعاهد فى جمهورية
         غانا حيث أن غانا دولة مسيحية وحملات التبشير المسيحية تتركز فى تلك
         البلاد .
       </Text>
       <Text style={styles.regularText}>أعمال لجنة الزكاة:</Text>
       <Text style={styles.regularText}>
         نبذة تاريخية عن تكوين اللجنة وتطورها خلال عشر سنوات:
       </Text>
       <Text style={styles.regularText}>
         تشكلت لجنة الزكاة بالجمعية بقرار رقم 30 بتاريخ 7 / 8 / 1981 وتم استيفاء
         الإجراءات القانونية لتشكيلها لدى وزارة الشئون الاجتماعية وبنك ناصر
         الإجتماعى وكانت الفترة التالية خلال عام 1981 ثم تطورت أعمال اللجنة
         تطوراً عظيماً ظهر ذلك جلياً فى الثقة التى نالتها لجنة الزكاة بين لجان
         الزكاة على مستوى الإسكندرية ذلك بفضل الـلَّه تعالى ثم بتضافر الجهود
         المخلصة والمتطوعة فى هذا المجال
       </Text>
       <Text style={styles.regularText}>تشكيل اللجنة:</Text>
       <Text style={styles.regularText}>• اللجنة الأساسية</Text>
       <Text style={styles.regularText}>• اللجنة الطبية .</Text>
       <Text style={styles.regularText}>• لجنة فتح الصناديق.</Text>
       <Text style={styles.regularText}>• الحاسب الآلى .</Text>
       <Text style={styles.regularText}>• لجان التقصى والصرف .</Text>
       <Text style={styles.regularText}>
         • لجنة دفاتر التبرعات والمبالغ المحصلة عن طريقهم .
       </Text>
       <Text style={styles.regularText}>
         تقييم أعمال اللجنة ونشاطها خلال العام المنتهى:
       </Text>
       <Text style={styles.regularText}>
         • فى معرض تقييم أعمال اللجنة نود أن نشير إلى التوسع الملحوظ فى نشاط
         اللجنة وهذا التوسع الملحوظ يأتى متزامناً مع الخير العميم الذى أفاء
         الـلَّه به فقد زادت من فضل الـلَّه موارد اللجنة والحمد لله كل ذلك منبثق
         من حب رواد المسجد لشيخنا الجليل فضيلة الشيخ ياسين رشدى مما أصبح معه
         مسجدنا نموذجاً فريداً ليس على مستوى الإسكندرية وحدها وإنما على مستوى
         الجمهورية .
       </Text>
       <Text style={styles.regularText}>
         • هذا وقد قامت لجنة الزكاة جميعها بأداء المهام الموكلة إليها كل فيما
         يخصه وعلى الوجه المطلوب من أعمال تقصى وفحص ودراسة وإعداد التقارير
         اللازمة لكل حالة على حدة .. وكذلك حساب المعونة وتوصيلها لمستحقيها بصفة
         منتظمة شهرياً مع استيفاء إجراءات الصرف والمتابعة المستمرة للحالات
         دورياً وإعادة التقصى عن جميع الأسر .
       </Text>
       <Text style={styles.regularText}>
         • كما تتمثل أنشطة اللجنة فى تقديم المعونات للأسر والأمراض المزمنة
         ومعونات الدفعة الواحدة وزكاة الفطر ومعونة الحج ومصروفات المدارس
         والسائلين. وقد بلغ عدد الأسر المستفيدة من أموال الزكاة حوالى 3450 أسرة
         ينفق عليها من ما تم تحصيله من رواد المسجد من تبرعات للصرف على الأسر
         وأغراض الزكاة المختلفة.. وقد قُسمت الإسكندرية إلى 24 منطقة تقوم اللجنة
         بخدمتها بمعونات شهرية وعلاج ودفعة واحدة ومساهمة فى مصاريف الزواج.
       </Text>
       <Text style={styles.regularText}>
         نشاط لجنة نشر الثقافة الدينية بمسجد المواساة:
       </Text>
       <Text style={styles.regularText}>
         • تأسست جمعية المواساة الإسلامية بالإسكندرية عام 1910 م .
       </Text>
       <Text style={styles.regularText}>
         • المساهمة فى المعونات للمرضى بأمراض مستعصية مثل: ( السرطان وأمراض
         الكلية وأمراض القلب )
       </Text>
       <Text style={styles.regularText}>
         • تزويد المراكز الإسلامية بالكتب الإسلامية باللغات المختلفة: (إنجليزى -
         فرنسى - المانى - عربى)
       </Text>
       <Text style={styles.regularText}>
         • تزويد المراكز الإسلامية بتفسير آيات القرآن على شرائط كاسيت بصوت فضيلة
         الشيخ ياسين محمد رشدى – رحمه الله .
       </Text>
       <Text style={styles.regularText}>
         مصروفات اللجنة : • مصروفات اللجنة هى رسوم الجمارك على الكتب والأشرطة
         وثمن طوابع البريد ورسوم التسجيل وتجهيز الطرود وحوالات بريدية لوزارة
         الثقافة .. أدوات كتابية متنوعة .
       </Text>
       <Text style={styles.regularText}>
         • يعتمد الصرف أساساً على حساب نشر الثقافة بالجمعية والذى مصدره الأساسى
         ما يدفعه السادة رواد المسجد تبرعاً منهم .
       </Text>
       <Text style={styles.regularText}>
         مشروعات اللجنة : تقوم اللجنة بمراسلة أكثر من 1500 مركز إسلامى موزعة على
         بعض دول العالم مثل الولايات المتحدة الأمريكية والمانيا وجمهورية غانا
         وجمهورية توجو وجمهورية ساحل العاج والمملكة العربية السعودية والفلبين
         وجمهورية نيجيريا واستراليا والعدد الأكبر من هذه المراكز والمدارس
         والمعاهد فى جمهورية غانا حيث أن غانا دولة مسيحية وحملات التبشير
         المسيحية تتركز فى تلك البلاد . أعمال لجنة الزكاة: نبذة تاريخية عن تكوين
         اللجنة وتطورها خلال عشر سنوات: تشكلت لجنة الزكاة بالجمعية بقرار رقم 30
         بتاريخ 7 / 8 / 1981 وتم استيفاء الإجراءات القانونية لتشكيلها لدى وزارة
         الشئون الاجتماعية وبنك ناصر الإجتماعى وكانت الفترة التالية خلال عام
         1981 ثم تطورت أعمال اللجنة تطوراً عظيماً ظهر ذلك جلياً فى الثقة التى
         نالتها لجنة الزكاة بين لجان الزكاة على مستوى الإسكندرية ذلك بفضل
         الـلَّه تعالى ثم بتضافر الجهود المخلصة والمتطوعة فى هذا المجال تشكيل
         اللجنة:
       </Text>
       <Text style={styles.regularText}>• اللجنة الأساسية </Text>
       <Text style={styles.regularText}>• اللجنة الطبية .</Text>
       <Text style={styles.regularText}>• لجنة فتح الصناديق.</Text>
       <Text style={styles.regularText}>• الحاسب الآلى .</Text>
       <Text style={styles.regularText}>• لجان التقصى والصرف .</Text>
       <Text style={styles.regularText}>
         • لجنة دفاتر التبرعات والمبالغ المحصلة عن طريقهم .
       </Text>
       <Text style={styles.regularText}>
         • فى معرض تقييم أعمال اللجنة نود أن نشير إلى التوسع الملحوظ فى نشاط
         اللجنة وهذا التوسع الملحوظ يأتى متزامناً مع الخير العميم الذى أفاء
         الـلَّه به فقد زادت من فضل الـلَّه موارد اللجنة والحمد لله كل ذلك منبثق
         من حب رواد المسجد لشيخنا الجليل فضيلة الشيخ ياسين رشدى مما أصبح معه
         مسجدنا نموذجاً فريداً ليس على مستوى الإسكندرية وحدها وإنما على مستوى
         الجمهورية .
       </Text>
       <Text style={styles.regularText}>
         • هذا وقد قامت لجنة الزكاة جميعها بأداء المهام الموكلة إليها كل فيما
         يخصه وعلى الوجه المطلوب من أعمال تقصى وفحص ودراسة وإعداد التقارير
         اللازمة لكل حالة على حدة .. وكذلك حساب المعونة وتوصيلها لمستحقيها بصفة
         منتظمة شهرياً مع استيفاء إجراءات الصرف والمتابعة المستمرة للحالات
         دورياً وإعادة التقصى عن جميع الأسر .
       </Text>
       <Text style={styles.regularText}>
         نشاط لجنة نشر الثقافة الدينية بمسجد المواساة:
       </Text>
       <Text style={styles.regularText}>
         • تأسست جمعية المواساة الإسلامية بالإسكندرية عام 1910 م .
       </Text>
       <Text style={styles.regularText}>
         • ترأس الجمعية فضيلة الشيخ ياسين محمد رشدى حتي وفاته يوم الأربعاء
         السادس عشر من شهر شعبان سنة 1431 هجرية.
       </Text>
       <Text style={styles.regularText}>
         • المساهمة بالأموال اللازمة فى حالات الكوارث التى تصيب العائلات .
       </Text>
       <Text style={styles.regularText}>
         • المساهمة فى المعونات للمرضى بأمراض مستعصية مثل: ( السرطان وأمراض
         الكلية وأمراض القلب )
       </Text>
       <Text style={styles.regularText}>
         • معونات الطوارئ مثل العمليات الجراحية والأطراف الصناعية والمساهمة فى
         التعويض عن الأضرار الناتجة عن الحريق والمساهمة فى تأسيس منازل لبعض
         المؤلفة قلوبهم حديثاً .
       </Text>
       <Text style={styles.regularText}>
         • نشر الثقافة الإسلامية عن طريق مراسلة المراكز الإسلامية فى مختلف بلاد
         العالم ومدها بالكتب والنشرات والمصاحف التى تساعدهم فى نشر الدعوة
         الإسلامية فى بلادهم والرد على أسئلتهم واستفساراتهم الدينية وكـذا
         الفتاوى التى يطلونها .
       </Text>
       <Text style={styles.regularText}>
         • أوجه نشاط أخرى اجتماعية وخيرية مثل إنشاء دور للحضانة ومراكز رياضية
         للشباب ومركز طبى للعلاج وكفالة للتعليم وكفالة اليتيم.
       </Text>
       <Text style={styles.regularText}>
         أعمــال لجنــة نشـــر الثقـــافــة:
       </Text>
       <Text style={styles.regularText}>
         • البحث عن عناوين المراكز الإسلامية والهيئات الإسلامية فى دول العالم
         المختلفة
       </Text>
       <Text style={styles.regularText}>
         • تزويد المراكز الإسلامية بالكتب الإسلامية باللغات المختلفة: (إنجليزى -
         فرنسى - المانى - عربى)
       </Text>
       <Text style={styles.regularText}>
         • تزويد المراكز الإسلامية بالمصحف الكريم باللغة العربية وترجمة معانى
         القرآن باللغات الإنجليزية والفرنسية والألمانية.
       </Text>
       <Text style={styles.regularText}>
         • تزويد المراكز الإسلامية بتفسير آيات القرآن على شرائط كاسيت بصوت فضيلة
         الشيخ ياسين محمد رشدى – رحمه الله . .
       </Text>
       <Text style={styles.regularText}>مصروفات اللجنة :</Text>
       <Text style={styles.regularText}>
         • مصروفات اللجنة هى رسوم الجمارك على الكتب والأشرطة وثمن طوابع البريد
         ورسوم التسجيل وتجهيز الطرود وحوالات بريدية لوزارة الثقافة .. أدوات
         كتابية متنوعة .
       </Text>
       <Text style={styles.regularText}>
         • يعتمد الصرف أساساً على حساب نشر الثقافة بالجمعية والذى مصدره الأساسى
         ما يدفعه السادة رواد المسجد تبرعاً منهم .
       </Text>
       <Text style={styles.regularText}>مشروعات اللجنة :</Text>
       <Text style={styles.regularText}>
         تقوم اللجنة بمراسلة أكثر من 1500 مركز إسلامى موزعة على بعض دول العالم
         مثل الولايات المتحدة الأمريكية والمانيا وجمهورية غانا وجمهورية توجو
         وجمهورية ساحل العاج والمملكة العربية السعودية والفلبين وجمهورية نيجيريا
         واستراليا والعدد الأكبر من هذه المراكز والمدارس والمعاهد فى جمهورية
         غانا حيث أن غانا دولة مسيحية وحملات التبشير المسيحية تتركز فى تلك
         البلاد . أعمال لجنة الزكاة: نبذة تاريخية عن تكوين اللجنة وتطورها خلال
         عشر سنوات: تشكلت لجنة الزكاة بالجمعية بقرار رقم 30 بتاريخ 7 / 8 / 1981
         وتم استيفاء الإجراءات القانونية لتشكيلها لدى وزارة الشئون الاجتماعية
         وبنك ناصر الإجتماعى وكانت الفترة التالية خلال عام 1981 ثم تطورت أعمال
         اللجنة تطوراً عظيماً ظهر ذلك جلياً فى الثقة التى نالتها لجنة الزكاة بين
         لجان الزكاة على مستوى الإسكندرية ذلك بفضل الـلَّه تعالى ثم بتضافر
         الجهود المخلصة والمتطوعة فى هذا المجال تشكيل اللجنة:
       </Text>
       <Text style={styles.regularText}>
         تقوم اللجنة بمراسلة أكثر من 1500 مركز إسلامى موزعة على بعض دول العالم
         مثل الولايات المتحدة الأمريكية والمانيا وجمهورية غانا وجمهورية توجو
         وجمهورية ساحل العاج والمملكة العربية السعودية والفلبين وجمهورية نيجيريا
         واستراليا والعدد الأكبر من هذه المراكز والمدارس والمعاهد فى جمهورية
         غانا حيث أن غانا دولة مسيحية وحملات التبشير المسيحية تتركز فى تلك
         البلاد .
       </Text>
       <Text style={styles.regularText}>• اللجنة الأساسية</Text>
       <Text style={styles.regularText}>• اللجنة الطبية .</Text>
       <Text style={styles.regularText}>• لجنة فتح الصناديق.</Text>
       <Text style={styles.regularText}>• الحاسب الآلى .</Text>
       <Text style={styles.regularText}>• لجان التقصى والصرف .</Text>
       <Text style={styles.regularText}>
         • لجنة دفاتر التبرعات والمبالغ المحصلة عن طريقهم .
       </Text>
       <Text style={styles.regularText}>
         تقييم أعمال اللجنة ونشاطها خلال العام المنتهى: • فى معرض تقييم أعمال
         اللجنة نود أن نشير إلى التوسع الملحوظ فى نشاط اللجنة وهذا التوسع
         الملحوظ يأتى متزامناً مع الخير العميم الذى أفاء الـلَّه به فقد زادت من
         فضل الـلَّه موارد اللجنة والحمد لله كل ذلك منبثق من حب رواد المسجد
         لشيخنا الجليل فضيلة الشيخ ياسين رشدى مما أصبح معه مسجدنا نموذجاً فريداً
         ليس على مستوى الإسكندرية وحدها وإنما على مستوى الجمهورية .
       </Text>
       <Text style={styles.regularText}>
         • كما تتمثل أنشطة اللجنة فى تقديم المعونات للأسر والأمراض المزمنة
         ومعونات الدفعة الواحدة وزكاة الفطر ومعونة الحج ومصروفات المدارس
         والسائلين. وقد بلغ عدد الأسر المستفيدة من أموال الزكاة حوالى 3450 أسرة
         ينفق عليها من ما تم تحصيله من رواد المسجد من تبرعات للصرف على الأسر
         وأغراض الزكاة المختلفة.. وقد قُسمت الإسكندرية إلى 24 منطقة تقوم اللجنة
         بخدمتها بمعونات شهرية وعلاج ودفعة واحدة ومساهمة فى مصاريف الزواج.
       </Text>
       <Text style={styles.regularText}>
         نشاط لجنة نشر الثقافة الدينية بمسجد المواساة:
       </Text>
       <Text style={styles.regularText}>1) تفسير القرآن الكريم.</Text>
       <Text style={styles.regularText}>2) شرح أحاديث البخارى.</Text>
       <Text style={styles.regularText}>
         3) خمسة عشر مؤلفا من مجموعة " سلسلة الطريق إلى الـله " وهى :
       </Text>
       <Text style={styles.regularText}>1. هو الـله</Text>
       <Text style={styles.regularText}>2. الإسلام وأركانه</Text>
       <Text style={styles.regularText}>3. الأحاديث القدسية</Text>
       <Text style={styles.regularText}>4. المحظورات</Text>
       <Text style={styles.regularText}>5. من أخلاقيات الإسلام</Text>
       <Text style={styles.regularText}>6. من مجامع الكلم</Text>
       <Text style={styles.regularText}>7. التربية في الإسلام</Text>
       <Text style={styles.regularText}>8. في رحاب الأصحاب</Text>
       <Text style={styles.regularText}>9. نساء مؤمنات</Text>
       <Text style={styles.regularText}>11. من أحكام الإسلام</Text>
       <Text style={styles.regularText}>
         12. تأملات في آيات من القرآن الكريم
       </Text>
       <Text style={styles.regularText}>13. من علوم القرآن وبلاغته</Text>
       <Text style={styles.regularText}>14. مناجاة</Text>
       <Text style={styles.regularText}>
         15. في رحاب المصطفي المختار (صلى الله عليه وسلم)
       </Text>
       <Text style={styles.regularText}>
         4) مراسلة ما يزيد عن 1500 مركز إسلامى على مستوى العالم الإسلامى وتزويد
         هذه المراكز بالكتب الدينية باللغات العربية والفرنسية والإنجليزية
         والنشرات والأشرطة.
       </Text>
       <Text style={styles.regularText}>
         5) ترجمة الكتب العربية لفضيلة الشيخ ياشين رشدى من اللغة العربية إلى
         كلاً من اللغة الفرنسية والإنجليزية مثل "هو الـلَّه"، "الإسلام وأركانه"،
         "المحظورات"، "أخلاقيات الإسلام".
       </Text>
       <Text style={styles.regularText}>
         6) تسجيلات لخطب الشيخ ودروسه على مدى أكثر من ثلاثين عاما
       </Text>
       <Text style={styles.regularText}>
         7) تسجيلات مرئية لخطب الشيخ ودروس رمضانية.
       </Text>
       <Text style={styles.regularText}>
         8) تصنيف لفتاوى الشيخ في كل مناحي الحياة
       </Text>
       <Text style={styles.regularText}>
         8) تصنيف لفتاوى الشيخ في كل مناحي الحياة
       </Text>
       <Text style={styles.regularText}>
         9) الإشراف و تحديث الموقع الرسمي لجمعية المواساة علي الأنترنت, و
         هوwww.almouassa.com
       </Text>
     </ScrollView>
   </View>
 );
}
const styles = StyleSheet.create({
  container: {
    flex: 1,
    alignItems: 'center',
    backgroundColor: '#ffffff',
  },
  image: {
    width: 354,
    height: 208,
    borderRadius: 14,
    marginBottom: 10,
  },
  Header: {
    color: "black",
    fontFamily: 'NotoKufiArabic-Regular',
    fontSize: 16,
    marginBottom: 10,
  },
  regularText: {
    fontSize: 14,
    color: "black",
    textAlign: 'center',
    marginBottom: 30,
  },
});
export default CharityScreen;