import React from 'react';
import { View,StyleSheet, ImageBackground, Text, ScrollView } from 'react-native';
import ScrollViewContext from 'react-native/Libraries/Components/ScrollView/ScrollViewContext';
import Header from '../components/Header';
import SearchBar from '../components/SearchBar';
function SheikScreen(props) {
 return (
   <View style={styles.container}>
     <Header />
     <SearchBar />
     <Text style={styles.Header}>نبذة عن الشيخ </Text>
     <ImageBackground
       source={require('../../assets/Sheik.png')}
       style={styles.image}
     />
     <ScrollView>
       <Text style={styles.regularText}>
         وُلد فضيلته بمصر في الأول من يناير من عام 1932م.
       </Text>
       <Text style={styles.regularText}>
         حصل على بكالوريوس العلوم البحرية سنة 1952م وشهادة ربان لأعالى البحار
         عام 1967 م
       </Text>
       <Text style={styles.regularText}>
         تدرج سيادته بالوظائف المدنية حتى درجة وكيل وزارة ثمَّ استقال من الوظائف
         المدنية عام 1983م. للتفرغ لأمور الدعوة والأعمال الخيرية
       </Text>
       <Text style={styles.regularText}>
         تدرج سيادته بالوظائف المدنية حتى درجة وكيل وزارة ثمَّ استقال من الوظائف
         المدنية عام 1983م. للتفرغ لأمور الدعوة والأعمال الخيرية
       </Text>
       <Text style={styles.regularText}>
         تربَّى فضيلته وتلقى العلم عن شيخه (فضيلة الشيخ/ محمد الأمير عبد
         المنعم). فعمل في مجال الدعوة الى الله منذ عام 1962م. بعد أن أذن له
         شيخُه بذلك وحتى وفاته
       </Text>
       <Text style={styles.regularText}>
         كان منهج الشيخ في الدعوة تعليم الناس كتاب الله وسنة رسوله (صلى الله
         عليه وسلم), فكان يخطب الجمعة بمسجد المواساة بالإسكندرية ومن خلال الخطبة
         يقوم بتفسير القرآن بأسلوب ميسر يستفيد منه المثقفون والعوام على سواء حتى
         أتمَّ التفسير كاملاً بفضل الله وتوفيقه, كما كان يقوم فضيلته بشرح صحيح
         البخاري يوم الثلاثاء من كل أسبوع بداية من عام 1977 م. حتى أتمَّ الشرح
         كاملاً, وكلُ ذلك حسبة لوجه الله تعالى, وبدون أي مقابل مادي.
       </Text>
       <Text style={styles.regularText}>
         قام فضيلته بتنظيم حلقات العلم في المسجد: كتحفيظ القرآن الكريم ( رجال
         ونساء وأطفال ), والتجويد, ودراسة الفقه، كما قام بشرح بعض علوم الدين
         الأخرى (كعلوم القرآن - والتعريف بالصحابة - وأخلاقيات الإسلام .. وما إلى
         ذلك).
       </Text>
       <Text style={styles.regularText}>
         تميَّز منهج الشيخ بالوسطية وعدم الانتماء أو التحيز لأي جماعة من
         الجماعات الإسلامية أو فرقة من الفرق.
       </Text>
       <Text style={styles.regularText}>
         قام سيادته بتوسعة المسجد ثلاث مرات (الأولى عام 1979 م., والثانية عام
         1989 م., والثالثة والأخيرة عام 1994 م.) لتصل مساحة المسجد إلى ما يزيد
         على سبعة أضعاف من مساحة المسجد الأصلي.
       </Text>
       <Text style={styles.regularText}>
         حصل الشيخ رحمه الله على نوط الامتياز من الطبقة الأولى من السيد/ رئيس
         جمهورية مصر العربية في يوم تكريم الدعاة بتاريخ (24 رجب 1411 ه.) الموافق
         9 فبراير 1991 م.
       </Text>
       <Text style={styles.regularText}>
         رأس فضيلته مجلس إدارة جمعية المواساة بالإسكندرية منذ عام 1991 م.، كما
         تم اختياره عضوًا بمجلس إدارة مستشفى المواساة (التابعة لجامعة
         الأسكندرية) بقرار المحافظ رقم 265 لسنة 1996 م. وذلك حتى وفاته.
       </Text>
       <Text style={styles.regularText}>
         قام فضيلته بإنشاء مركز المواساة الإسلامى الدولي عام 1984 م. وهذا المركز
         يقوم بالاتصال بما يزيد عن ألف مركز على مستوى العالم الإسلامى. ويتم
         تزويد تلك المراكز بالكتب والنشرات الدينية – مجانا دون مقابل مادي -
         باللغة العربية والإنجليزية والفرنسية بالتعاون مع كل من الأزهر الشريف
         والمجلس الأعلى للشئون الإسلامية.
       </Text>
       <Text style={styles.regularText}>
         قام فضيلته بإنشاء مركز المواساة الإسلامى الدولي عام 1984 م. وهذا المركز
         يقوم بالاتصال بما يزيد عن ألف مركز على مستوى العالم الإسلامى. ويتم
         تزويد تلك المراكز بالكتب والنشرات الدينية – مجانا دون مقابل مادي -
         باللغة العربية والإنجليزية والفرنسية بالتعاون مع كل من الأزهر الشريف
         والمجلس الأعلى للشئون الإسلامية.
       </Text>
       <Text style={styles.regularText}>
         لسيادته العديد من البرامج الناجحة في تليفزيون جمهورية مصر العربية,
         وإذاعة وتليفزيون الإسكندرية, واذاعة القرآن الكريم, فضلاً عن المقالات
         المنشورة لسيادته بالصحف. كما أن بعض مقالاته تُرجِمت لمجلة الأزهر. وكل
         ذلك أيضا حسبة لوجه الله تعالى وبدون مقابل مادي.
       </Text>
       <Text style={styles.regularText}>
         أنشأ لجنة الزكاة والقرض الحسن بالجمعية والتي تقوم بالصرف على ما يزيد عن
         (3500 أسرة) بمدينة الإسكندرية، بخلاف الصرف على الحالات التي تحتاج
         لإعانة عاجلة (كالكوارث - والعمليات الجراحية .... وما إلى ذلك).
       </Text>
       <Text style={styles.regularText}>
         أنشأ لجنة الزكاة والقرض الحسن بالجمعية والتي تقوم بالصرف على ما يزيد عن
         (3500 أسرة) بمدينة الإسكندرية، بخلاف الصرف على الحالات التي تحتاج
         لإعانة عاجلة (كالكوارث - والعمليات الجراحية .... وما إلى ذلك).
       </Text>
       <Text style={styles.regularText}>
         أنشأ سيادته لجنة كفالة المريض لعلاج المرضى الفقراء مجانا, ويشمل العلاج:
         (الكشف والتحاليل والإشعات وإجراء العمليات الجراحية وصرف الدواء)
       </Text>
       <Text style={styles.regularText}>
         أنشأ لجنة الزكاة والقرض الحسن بالجمعية والتي تقوم بالصرف على ما يزيد عن
         (3500 أسرة) بمدينة الإسكندرية، بخلاف الصرف على الحالات التي تحتاج
         لإعانة عاجلة (كالكوارث - والعمليات الجراحية .... وما إلى ذلك).
       </Text>
       <Text style={styles.regularText}>
         أنشأ مركز المواساة الطبى (بمنطقة القبارى بالأسكندرية) على أعلى مستوى
         طبي وخدمي، وقد تم تجهيزه بأحدث الأجهزة الطبية لخدمة أبناء الحي الفقراء
         بأسعار رمزية.
       </Text>
       <Text style={styles.regularText}>
         أتم إصلاح وتشجير وإضاءة المنطقة المحيطة بالمسجد بما في ذلك السلم المؤدي
         إلى منطقة الحضرة والذي عن طريقه يتم الوصول إلى كافة المستشفيات المحيطة
         بالمسجد. أشرف على مكاتب توجيه الأسرة.
       </Text>
       <Text style={styles.regularText}>
         أنشأ فضيلته لجنة كفالة اليتيم وهي ترعى (2160) أسرة وعدد من الأيتام بلغ
         (3745) يتيماً.
       </Text>
       <Text style={styles.regularText}>
         أنشأ داراً للمسنين (منتجع المواساة) بجوار المسجد مباشرة. أنشأ حضانة
         للأطفال.
       </Text>
       <Text style={styles.regularText}>
         توفي فضيلته يوم الأربعاء السادس عشر من شعبان لسنة 1431ه. الموافق
         28-7-2010 م.
       </Text>
       <Text style={styles.regularText}>
         صدر لسيادته خمسة عشر (15) مؤلفاً سُميت " سلسلة الطريق إلى الـله " وهي:
       </Text>
       <Text style={styles.regularText}>1. هو الـله</Text>
       <Text style={styles.regularText}> 2. الإسلام وأركانه</Text>
       <Text style={styles.regularText}> 3. الأحاديث القدسية</Text>
       <Text style={styles.regularText}> 4. المحظورات</Text>
       <Text style={styles.regularText}> 5. من أخلاقيات الإسلام</Text>
       <Text style={styles.regularText}> 6. من مجامع الكلم</Text>
       <Text style={styles.regularText}> 7. التربية في الإسلام</Text>
       <Text style={styles.regularText}> 8. في رحاب الأصحاب</Text>
       <Text style={styles.regularText}>9. نساء مؤمنات</Text>
       <Text style={styles.regularText}>10. التصوف ماله وما عليه</Text>
       <Text style={styles.regularText}>
         12. تأملات في آيات من القرآن الكريم
       </Text>
       <Text style={styles.regularText}> 13. من علوم القرآن وبلاغته</Text>
       <Text style={styles.regularText}> 14. مناجاة</Text>
       <Text style={styles.regularText}>
         15. في رحاب المصطفي المختار (صلى الله عليه وسلم)
       </Text>
       <Text style={styles.regularText}>
         وجميع هذه المؤلفات تمت مراجعتها والموافقة عليها من مجمع البحوث
         الإسلامية بالأزهر الشريف, كما تُرجمت بعضها الى الإنجليزية والفرنسية,
         ويتم حالياً ترجمة باقي الكتب
       </Text>
       <Text style={styles.regularText}>
         والجدير بالذكر أنَّ كل هذه الكتب تُهدى ولا تُباع. وجميعها يمكن تحميله
         من موقع الألكتروني أو من خلال التطبيقات الخاصة بأجهزة التليفونات
         الذكية.
       </Text>
       <Text style={styles.regularText}>
         ومن فضل الله أن جميع إصدارات فضيلته متوفرة على شرائط كاسيت مسموعة وأخرى
         فيديو مرأية وكذلك علي أسطوانات (CD - DVD) وأقراص كمبيوتر صلبة (Hard
         Disk)
       </Text>
       <Text style={styles.regularText}>
         ومن المهم الإشارة الى أنَّ كل ذلك تحت إشراف لجنة نشر الثقافة - الكائنة
         بمقر المسجد في الأسكندرية.
       </Text>
     </ScrollView>
   </View>
 );
}
const styles = StyleSheet.create({
  container: {
    flex: 1,
    alignItems: 'center',
    backgroundColor: '#ffffff',
  },
  image: {
    width: 354,
    height: 208,
    borderRadius: 14,
    marginBottom: 10,
  },
  Header: {
    color: "black",
    fontFamily: 'NotoKufiArabic-Regular',
    fontSize: 16,
    marginBottom: 10,
  },
  regularText:{
    fontSize:14,
    color:"black",
    textAlign:"center",
    marginBottom:10
  }
});
export default SheikScreen;